import Category from '../models/category'
import Meal from '../models/meal'

export const CATEGORIES = [
  new Category('c1', '粤菜', 'yellow'),
  new Category('c2', '川菜', 'red'),
  new Category('c3', '鲁菜', 'pink'),
  new Category('c4', '江苏菜', 'green'),
  new Category('c5', '闽菜', '#08f'),
  new Category('c6', '浙江菜', 'aqua'),
  new Category('c7', '湘菜', 'violet'),
  new Category('c8', '徽菜', 'skyblue'),
  new Category('c9', '主菜', '#cf9'),
  new Category('c10', '甜点', '#bf6')
]

export const MEALS = [
  new Meal(
    'm1',
    ['c1', 'c10'],
    '双皮奶',
    '实惠',
    '简单',
    'https://img01.71360.com/file/read/www/M00/64/1E/wKj0iWDtWxeAaIPPAAI0xv-OzGk079.jpg',
    10,
    ['牛奶400毫升', '鸡蛋（蛋清）2只', '白砂糖2勺'],
    [
      '把牛奶倒入锅中，等刚煮沸即可停止加热。然后将牛奶倒入大碗，不久即可看到牛奶表面结起一层皱皱的奶皮。',
      '另取一碗，放入2只蛋清、2勺白砂糖，搅匀至糖溶解（记得不要打太久，否则会变成“蛋泡”）。',
      '等牛奶稍凉后，用筷子把奶皮刺破，再将牛奶慢慢倒入装有蛋清的大碗，搅拌均匀。然后沿碗边缓缓将之倒回留有奶皮的大碗，此时可看到奶皮自动浮起。',
      '将牛奶放入锅中隔水蒸10分钟左右，用筷子从中间刺入，没有牛奶流出说明全部凝结。'
    ],
    true,
    false
  ),
  new Meal(
    'm2',
    ['c2', 'c9'],
    '水煮牛肉',
    '实惠',
    '有挑战',
    'https://gss0.baidu.com/7LsWdDW5_xN3otqbppnN2DJv/zhidao/pic/item/1c950a7b02087bf447f0a932f9d3572c10dfcfc9.jpg',
    80,
    ['牛柳(250克)', '莴笋(100克)', '黄豆芽(100克)', '干辣椒(10只)', '花椒(1汤匙)', '姜(3片)', '葱(2根)', '蒜(3瓣)', '生抽(2汤匙)', '料酒(1汤匙)', '生粉(1汤匙)', '鸡蛋清(1汤匙)', '白糖(1/3汤匙)', '清水(3汤匙)', '油(3汤匙)', '辣椒油(3汤匙)', '生抽(1汤匙)', '鸡粉(1/2汤匙)', '花椒粉(1汤匙)'],
    [
      '洗干净 牛柳，逆着纹理切成薄片，加入腌料抓匀，腌制15分钟；干辣椒切丁，姜蒜剁末，葱切葱花，香菜切段。',
      '莴笋去皮洗净，斜切成薄片；黄豆芽去 老根洗净，放入沸水中焯一下，捞起过冷河沥干水。',
      '取一 大碗，先在底部铺上一层黄豆芽，再铺上一层莴笋片。',
      '烧热3汤匙油，加入1汤匙花椒炒香，捞起弃之 ，留锅中油，倒入姜蒜末、葱白末和干辣椒炒香。',
      '注入2杯清水搅匀煮沸，加入3汤匙辣椒油、1汤匙生抽和1/2汤 匙鸡粉调味。',
      '放入牛肉片快速搅散，煮至肉片变色，便可熄火。',
      '将水 煮牛肉倒入大碗内，淋在莴笋和黄豆芽上。',
      '洒上1汤匙花椒粉和葱花，即可上桌。'
    ],
    false,
    true
  ),
  new Meal(
    'm3',
    ['c1', 'c9'],
    '煲仔饭',
    '实惠',
    '有挑战',
    'https://gimg2.baidu.com/image_search/src=http%3A%2F%2Fsafe-img.xhscdn.com%2Fbw1%2F3048a687-0eed-4109-947b-a32712ccdb44%3FimageView2%2F2%2Fw%2F1080%2Fformat%2Fjpg&refer=http%3A%2F%2Fsafe-img.xhscdn.com&app=2002&size=f9999,10000&q=a80&n=0&g=0n&fmt=auto?sec=1702082102&t=a68ef8a92a09bd8c4494d176516aee2c',
    60,
    ['排骨500克', '大米300克', '香菇3个', '油菜3棵', '精盐', '色拉油', '葱丝', '白糖', '姜', '鸡精', '老抽'],
    [
      '排骨事先用蚝油，生抽，水淀粉，糖，蒜香油，少许老抽，少许盐，少许味 精腌制1小时当然也是久点更好了；',
      '放入洗好的大米，加入适量的水，选择米饭类，大约10分钟左右，排气开盖；',
      '将腌制好的排骨、香菇，放入电压力锅中，用勺子装一点油，沿着煲边轻轻地淋一圈，选择排骨键，大约15分钟，排气开盖；',
      '将油菜放入开水中，焯熟，放入煲好的排骨饭中即可食用。'
    ],
    false,
    false
  ),
  new Meal(
    'm4',
    ['c3', 'c9'],
    '九转大肠',
    '实惠',
    '困难',
    'https://pics1.baidu.com/feed/c8ea15ce36d3d539615685c36390825c352ab06f.jpeg@f_auto?token=73484389b52b40906cec40f1f33687db',
    60,
    ['熟猪大肠500克', '葱姜蒜末', '生抽', '酱油', '老抽', '盐', '糖', '绍酒', '醋', '鸡精', '胡椒粉', '肉桂粉', '砂仁粉', '香菜'],
    [
      '将熟大肠切成2CM长的段。',
      '放入开水中焯一下，捞出沥干水分。',
      '锅中倒入植物油，油温7成热时下大肠炸至金黄，捞出沥油。',
      '锅中留底油，下葱姜蒜末爆香，倒入清汤，加入生抽酱油、老抽酱油、盐、糖、绍酒、醋、鸡精。',
      '再倒入大肠，大火烧开，转小火将大肠煨透。',
      '待汤汁收粘稠时，加入胡椒粉、肉桂粉、砂仁粉。',
      '最后淋入花椒油，起锅前撒上香菜末即可。'
    ],
    false,
    false
  ),
  new Meal(
    'm5',
    ['c4', 'c9'],
    '蟹粉狮子头',
    '中等',
    '有挑战',
    'https://ts1.cn.mm.bing.net/th/id/R-C.f6b609e114d7e512cc57b4dfc81d401e?rik=qtqG%2fIG3b8aLhg&riu=http%3a%2f%2ffspic.okjm.cn%2fpic%2f04%2f016954_05.jpg&ehk=iFDJHz%2bVkKqzgsMRIJrNb0%2fCZ3vQlbGb5dGz8DprB00%3d&risl=&pid=ImgRaw&r=0',
    45,
    ['猪肋条肉（五花肉）(800克)', '蟹肉(125克)', '虾籽(1克)', '蟹黄(50克)', '生菜(200克)', '料酒(100克)', '小葱(100克)', '姜(30克)', '猪油（炼制）(50克)', '盐(15克)', '淀粉(蚕豆)(25克)'],
    ['猪肉斩成石榴米状；', '放碗中，加葱、姜汁、蟹肉、虾子、盐、料酒、淀粉搅拌上劲；', '青菜心洗净过油码入沙锅内，加肉汤烧开；', '拌好的肉挤成肉丸，码在菜心上，再点上蟹黄，上盖菜叶，加盖微火焖2小时即成。'],
    false,
    false
  ),
  new Meal(
    'm6',
    ['c5', 'c9'],
    '佛跳墙',
    '昂贵',
    '困难',
    'https://pic4.zhimg.com/v2-87c5053a563a90ce85bd41706cf6bbbf_r.jpg?source=1940ef5c',
    120,
    ['干鲍鱼（或新鲜珍珠鲍）6只', '花胶1片', '干海参（或市场售水发海参）6条', '老母鸡汤1锅', '鸭胸肉（或鸭腿肉）1块', '火腿肉100g', '花菇（或泡好的干香菇）5个', '草虾（或河虾）6只', '文蛤10个', '猪爪1个', '鸽子蛋（或鹌鹑蛋）10枚', '冬笋1个', '瑶柱（或者干贝）1把', '五花肉'],
    ['把鸭腿，猪爪焯出来，鲜鲍鱼洗净，发干海参', , '金华火腿鲍鱼蒸熟，五花肉焯水，冬菇冬笋，鸽子蛋煮好', '炒鸭腿猪爪', '再放入其他肉类加高汤，冬菇和笋最后放', '砂锅炖5个小时', '收汁盛出', '周围摆上西兰花和鸽子（鹌鹑）蛋，滋补'],
    false,
    false
  ),
  new Meal(
    'm7',
    ['c2'],
    '拍黄瓜',
    '实惠',
    '简单',
    'https://gimg2.baidu.com/image_search/src=http%3A%2F%2Fss2.meipian.me%2Fusers%2F7772090%2F0d497ce4e02b4123b70db462ab073c86.jpg%3Fmeipian-raw%2Fbucket%2Fivwen%2Fkey%2FdXNlcnMvNzc3MjA5MC8wZDQ5N2NlNGUwMmI0MTIzYjcwZGI0NjJhYjA3M2M4Ni5qcGc%3D%2Fsign%2Fd046a74d2133898fd566e0551d676df5.jpg&refer=http%3A%2F%2Fss2.meipian.me&app=2002&size=f9999,10000&q=a80&n=0&g=0n&fmt=auto?sec=1702431480&t=c8e47291b488534e6aea993e29ff09a8',
    5,
    ['黄瓜', '香油', '精盐', '蒜泥', '醋'],
    ['将黄瓜洗净，拿一块干净的布包住黄瓜（这样拍黄瓜的时候，不会瓜汁四溅了）放在案板上用刀拍开，顺长切成两半。', '然后采用抹刀法切成小抹刀块，放入盆内，拌入精盐、蒜泥、香油（没有香油炝入花椒油亦可）即成。食时盛盘内淋入少许醋。'],
    true,
    true
  ),
  new Meal(
    'm8',
    ['c8', 'c10'],
    '龙须酥',
    '实惠',
    '困难',
    'https://img2.baidu.com/it/u=3557173952,1559340142&fm=253&fmt=auto&app=120&f=PNG?w=596&h=354',
    45,
    ['饴糖500g', '黄豆粉500g'],
    ['把麦芽糖放在干净的小盆里，坐在热水锅中慢慢化开，让麦芽糖变软。将变软的麦芽糖取出，放在案子上反复揉搓，像和面一样。', '蘸上糯米粉将中间的洞拉大，扭成“8”字，然后重合，不断重复，直至呈拉丝状。', '把其余材料像沾糯米粉一样混合包入糖丝内，卷起来，整好形。即成。'],
    true,
    false
  )
]
